УТ_для_edt/src/Catalogs/смартДЛ_ПараметрыНГГ/смартДЛ_ПараметрыНГГ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартДЛ_ПараметрыНГГ</name>
  <attributes>
    <name>Длина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартДЛ_ПараметрыНГГ/ManagerModule.bsl
Функция ПолучитьМассивПоляПоиска() Экспорт 
	
	Возврат смартДеловыеЛинии.МассивДвухЭлементов("serviceKind", "UID");
	
КонецФункции  

Функция ПолучитьТаблицуПолейЗначений() Экспорт
	
	Результат = смартДеловыеЛинии.НоваяТаблицаПолейЗначений();
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "oversizedLength", "Длина", "Реквизит");
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "oversizedWidth", "Ширина", "Реквизит");
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "oversizedHeight", "Высота", "Реквизит");
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "oversizedWeight", "Вес", "Реквизит");
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "oversizedVolume", "Объем", "Реквизит"); 
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "serviceKind", "Наименование", "Реквизит");
	
	Возврат Результат;
	
КонецФункции
